###################
# 2주차 주별 과제 #
###################
# !!주의사항!!
# 각 문제에 제시되어 있는 결과 예시와 같게 나오는지 반드시 확인하세요.
# 각 문제의 다음 줄에 각 문제당 답을 작성하여 진행하세요.
# 파일명을 task01-학번.R (예시:task01-2000000000.R)로 제출해주세요.
# 각 문제에 대한 답에는 주석을 달아 각 줄의 코드가 어떤 의미인지에 대해서 노트해두세요.
# 한글 깨짐 현상이 없도록 주의하세요.(텍스트 인코딩 설정)
# 수업 시간에 배운 내용이 아닌 경우 같은 결과 출력되더라도 감점됩니다.
# 타인과 상의하거나 답을 공유하면 0점 처리됩니다.



# 1. 다음 표의 내용을 학습한 두 가지 방법을 모두 사용하여 데이터 프레임 구조로 만들어보고 다음 실행결과와 같이 나오도록 출력하세요. 
# 단, 데이터 프레임의 이름은 적절한 변수명을 지정하여 만드세요.

#이름 성별  취미  나이
#aaa  남자  독서  25
#bbb  여자  등산  23
#ccc  여자  게임  28
#ddd  남자  야구  29

#   name gender hobby age
#1  aaa   남자  독서  25
#2  bbb   여자  등산  23
#3  ccc   여자  게임  28
#4  ddd   남자  야구  29

#첫 번째 방법: 먼저 각각의 칼럼을 하나의 벡터로 만들어준다. 데이터 프레임이라는 함수를 사용해서 데이터 프레임으로 만들어 주고 안에 순서대로 벡터를 나열해준다.
name <- c("aaa", "bbb", "ccc", "ddd")   #c()함수: name의 데이터를 결합한다. name이라는 열을 벡터로 만들어준다.
gender <- c("남자", "여자", "여자", "남자")   #c()함수: gender의 데이터를 결합한다. gender라는 열을 벡터로 만들어준다.
hobby <- c("독서", "등산", "게임", "야구")  #c()함수: hobby의 데이터를 결합한다. hobby라는 열을 벡터로 만들어준다.
age <- c(25, 23, 28, 29)  #c()함수: age의 데이터를 결합한다. age라는 열을 벡터로 만들어준다.
people <- data.frame(name, gender, hobby, age)  #데이터 프레임(Data Frame)을 사용하여 데이터 프레임 구조를 만든다.
people

#두 번째 방법:  데이터 프레임을 한 번에 만들고 벡터를 따로 만들지 않는다. 안에 c() 함수를 사용하여 각 열의 칼럼을 나열한다.
#이러한 방식으로 나머지 부분을 입력하면 견지 할당하는 게 아니기 때문에 등호를 사용할 수 있다. 쉼표로 줄을 바꿔서 입력하면 가독성에 문제없이 잘 익힐 수 있다.
people <- data.frame(name = c("aaa", "bbb", "ccc", "ddd"), 
                     gender = c("남자", "여자", "여자", "남자"), 
                     hobby = c("독서", "등산", "게임", "야구"), 
                     age = c(25, 23, 28, 29))
people


# 2. 다음 실행결과와 같이 위 데이터 프레임에서 ccc의 데이터를 모두 출력되도록 하세요.
# 단, 반드시 아래 실행결과와 같아야 합니다.

#   name gender hobby age
#3  ccc   여자  게임  28

#데이터프레임명[행번호,]： 지정된 행의 모든 값 출력
people[3,]


# 3. 다음 실행결과 같이 위 데이터 프레임에서 취미정보를 모두 출력되도록 하세요. 
# 단, 반드시 아래 실행결과와 같아야 합니다.
# 배운 방법이 여러 가지라면 모두 작성해주세요.

#[1] "독서" "등산" "게임" "야구"

#데이터프레임명$변수명：지정하면 변수명의 열 값이 출력
people$hobby
# 리스트명[[“원소명“]]：원소값만 출력
people[["hobby"]]


# 4. 다음 실행결과 같이 위 데이터 프레임에서 aaa의 취미를 축구로 변경하고, 다시 아래와 같이 출력하세요.

#   name gender hobby age
# 1  aaa   남자  축구  25
# 2  bbb   여자  등산  23
# 3  ccc   여자  게임  28
# 4  ddd   남자  야구  29

#데이터프레임명[행번호,열번호] <- 값： 해당위치의 원소값 변경
people[1,3] <- "축구"
people


# 5. 워킹 디렉터리(프로젝트 폴더)에 'rain.csv' 파일을 다운로드 받아서 불러와 데이터 프레임에 저장하고 출력해 보세요.

#read.csv () 함수를 사용하여 csv 파일 불러오기
df <- read.csv('rain.csv')
df


# 6. 위 문제에서 불러온 'rain.csv' 파일에 들어있는 변수의 속성을 자세히 알려주는 함수를 사용하여 아래의 결과와 같이 확인해보세요.

# 'data.frame':	10 obs. of  3 variables:
#   $ 년    : int  2011 2012 2013 2014 2015 2016 2017 2018 2019 2020
# $ 지점  : int  108 108 108 108 108 108 108 108 108 108
# $ 강수량: num  2039 1646 1404 809 792 ...

#str() 함수: 변수 속성을 자세히 설명한다.
str(df)
